garyPenhook/PIC-Assembler/device_includes/pic16f17576.inc
// Register: OPA4CON0
#define OPA4CON0 OPA4CON0
OPA4CON0                                 equ 0A8Ch
// bitfield definitions
OPA4CON0_UG_POSN                         equ 0003h
OPA4CON0_UG_POSITION                     equ 0003h
OPA4CON0_UG_SIZE                         equ 0001h
OPA4CON0_UG_LENGTH                       equ 0001h
OPA4CON0_UG_MASK                         equ 0008h
OPA4CON0_EN_POSN                         equ 0007h
OPA4CON0_EN_POSITION                     equ 0007h
OPA4CON0_EN_SIZE                         equ 0001h
OPA4CON0_EN_LENGTH                       equ 0001h
OPA4CON0_EN_MASK                         equ 0080h
OPA4CON0_UG0_POSN                        equ 0003h
OPA4CON0_UG0_POSITION                    equ 0003h
OPA4CON0_UG0_SIZE                        equ 0001h
OPA4CON0_UG0_LENGTH                      equ 0001h
OPA4CON0_UG0_MASK                        equ 0008h
OPA4CON0_OPA4UG_POSN                     equ 0003h
OPA4CON0_OPA4UG_POSITION                 equ 0003h
OPA4CON0_OPA4UG_SIZE                     equ 0001h
OPA4CON0_OPA4UG_LENGTH                   equ 0001h
OPA4CON0_OPA4UG_MASK                     equ 0008h
OPA4CON0_OPA4EN_POSN                     equ 0007h
OPA4CON0_OPA4EN_POSITION                 equ 0007h
OPA4CON0_OPA4EN_SIZE                     equ 0001h
OPA4CON0_OPA4EN_LENGTH                   equ 0001h
OPA4CON0_OPA4EN_MASK                     equ 0080h

// Register: OPA4CON2
#define OPA4CON2 OPA4CON2
OPA4CON2                                 equ 0A8Dh
// bitfield definitions
OPA4CON2_PCH_POSN                        equ 0000h
OPA4CON2_PCH_POSITION                    equ 0000h
OPA4CON2_PCH_SIZE                        equ 0004h
OPA4CON2_PCH_LENGTH                      equ 0004h
OPA4CON2_PCH_MASK                        equ 000Fh
OPA4CON2_PCH0_POSN                       equ 0000h
OPA4CON2_PCH0_POSITION                   equ 0000h
OPA4CON2_PCH0_SIZE                       equ 0001h
OPA4CON2_PCH0_LENGTH                     equ 0001h
OPA4CON2_PCH0_MASK                       equ 0001h
OPA4CON2_PCH1_POSN                       equ 0001h
OPA4CON2_PCH1_POSITION                   equ 0001h
OPA4CON2_PCH1_SIZE                       equ 0001h
OPA4CON2_PCH1_LENGTH                     equ 0001h
OPA4CON2_PCH1_MASK                       equ 0002h
OPA4CON2_PCH2_POSN                       equ 0002h
OPA4CON2_PCH2_POSITION                   equ 0002h
OPA4CON2_PCH2_SIZE                       equ 0001h
OPA4CON2_PCH2_LENGTH                     equ 0001h
OPA4CON2_PCH2_MASK                       equ 0004h
OPA4CON2_OPA4PCH_POSN                    equ 0000h
OPA4CON2_OPA4PCH_POSITION                equ 0000h
OPA4CON2_OPA4PCH_SIZE                    equ 0004h
OPA4CON2_OPA4PCH_LENGTH                  equ 0004h
OPA4CON2_OPA4PCH_MASK                    equ 000Fh
OPA4CON2_OPA4PCH0_POSN                   equ 0000h
OPA4CON2_OPA4PCH0_POSITION               equ 0000h
OPA4CON2_OPA4PCH0_SIZE                   equ 0001h
OPA4CON2_OPA4PCH0_LENGTH                 equ 0001h
OPA4CON2_OPA4PCH0_MASK                   equ 0001h
OPA4CON2_OPA4PCH1_POSN                   equ 0001h
OPA4CON2_OPA4PCH1_POSITION               equ 0001h
OPA4CON2_OPA4PCH1_SIZE                   equ 0001h
OPA4CON2_OPA4PCH1_LENGTH                 equ 0001h
OPA4CON2_OPA4PCH1_MASK                   equ 0002h
OPA4CON2_OPA4PCH2_POSN                   equ 0002h
OPA4CON2_OPA4PCH2_POSITION               equ 0002h
OPA4CON2_OPA4PCH2_SIZE                   equ 0001h
OPA4CON2_OPA4PCH2_LENGTH                 equ 0001h
OPA4CON2_OPA4PCH2_MASK                   equ 0004h

// Register: OPA4CON3
#define OPA4CON3 OPA4CON3
OPA4CON3                                 equ 0A8Eh
// bitfield definitions
OPA4CON3_NCH_POSN                        equ 0000h
OPA4CON3_NCH_POSITION                    equ 0000h
OPA4CON3_NCH_SIZE                        equ 0005h
OPA4CON3_NCH_LENGTH                      equ 0005h
OPA4CON3_NCH_MASK                        equ 001Fh
OPA4CON3_NCH0_POSN                       equ 0000h
OPA4CON3_NCH0_POSITION                   equ 0000h
OPA4CON3_NCH0_SIZE                       equ 0001h
OPA4CON3_NCH0_LENGTH                     equ 0001h
OPA4CON3_NCH0_MASK                       equ 0001h
OPA4CON3_NCH1_POSN                       equ 0001h
OPA4CON3_NCH1_POSITION                   equ 0001h
OPA4CON3_NCH1_SIZE                       equ 0001h
OPA4CON3_NCH1_LENGTH                     equ 0001h
OPA4CON3_NCH1_MASK                       equ 0002h
OPA4CON3_NCH2_POSN                       equ 0002h
OPA4CON3_NCH2_POSITION                   equ 0002h
OPA4CON3_NCH2_SIZE                       equ 0001h
OPA4CON3_NCH2_LENGTH                     equ 0001h
OPA4CON3_NCH2_MASK                       equ 0004h
OPA4CON3_OPA4NCH_POSN                    equ 0000h
OPA4CON3_OPA4NCH_POSITION                equ 0000h
OPA4CON3_OPA4NCH_SIZE                    equ 0005h
OPA4CON3_OPA4NCH_LENGTH                  equ 0005h
OPA4CON3_OPA4NCH_MASK                    equ 001Fh
OPA4CON3_OPA4NCH0_POSN                   equ 0000h
OPA4CON3_OPA4NCH0_POSITION               equ 0000h
OPA4CON3_OPA4NCH0_SIZE                   equ 0001h
OPA4CON3_OPA4NCH0_LENGTH                 equ 0001h
OPA4CON3_OPA4NCH0_MASK                   equ 0001h
OPA4CON3_OPA4NCH1_POSN                   equ 0001h
OPA4CON3_OPA4NCH1_POSITION               equ 0001h
OPA4CON3_OPA4NCH1_SIZE                   equ 0001h
OPA4CON3_OPA4NCH1_LENGTH                 equ 0001h
OPA4CON3_OPA4NCH1_MASK                   equ 0002h
OPA4CON3_OPA4NCH2_POSN                   equ 0002h
OPA4CON3_OPA4NCH2_POSITION               equ 0002h
OPA4CON3_OPA4NCH2_SIZE                   equ 0001h
OPA4CON3_OPA4NCH2_LENGTH                 equ 0001h
OPA4CON3_OPA4NCH2_MASK                   equ 0004h

// Register: OPA4OFFSET
#define OPA4OFFSET OPA4OFFSET
OPA4OFFSET                               equ 0A8Fh
// bitfield definitions
OPA4OFFSET_OFFSET_POSN                   equ 0000h
OPA4OFFSET_OFFSET_POSITION               equ 0000h
OPA4OFFSET_OFFSET_SIZE                   equ 0008h
OPA4OFFSET_OFFSET_LENGTH                 equ 0008h
OPA4OFFSET_OFFSET_MASK                   equ 00FFh
OPA4OFFSET_OFFSET0_POSN                  equ 0000h
OPA4OFFSET_OFFSET0_POSITION              equ 0000h
OPA4OFFSET_OFFSET0_SIZE                  equ 0001h
OPA4OFFSET_OFFSET0_LENGTH                equ 0001h
OPA4OFFSET_OFFSET0_MASK                  equ 0001h
OPA4OFFSET_OFFSET1_POSN                  equ 0001h
OPA4OFFSET_OFFSET1_POSITION              equ 0001h
OPA4OFFSET_OFFSET1_SIZE                  equ 0001h
OPA4OFFSET_OFFSET1_LENGTH                equ 0001h
OPA4OFFSET_OFFSET1_MASK                  equ 0002h
OPA4OFFSET_OFFSET2_POSN                  equ 0002h
OPA4OFFSET_OFFSET2_POSITION              equ 0002h
OPA4OFFSET_OFFSET2_SIZE                  equ 0001h
OPA4OFFSET_OFFSET2_LENGTH                equ 0001h
OPA4OFFSET_OFFSET2_MASK                  equ 0004h
OPA4OFFSET_OFFSET3_POSN                  equ 0003h
OPA4OFFSET_OFFSET3_POSITION              equ 0003h
OPA4OFFSET_OFFSET3_SIZE                  equ 0001h
OPA4OFFSET_OFFSET3_LENGTH                equ 0001h
OPA4OFFSET_OFFSET3_MASK                  equ 0008h
OPA4OFFSET_OFFSET4_POSN                  equ 0004h
OPA4OFFSET_OFFSET4_POSITION              equ 0004h
OPA4OFFSET_OFFSET4_SIZE                  equ 0001h
OPA4OFFSET_OFFSET4_LENGTH                equ 0001h
OPA4OFFSET_OFFSET4_MASK                  equ 0010h
OPA4OFFSET_OFFSET5_POSN                  equ 0005h
OPA4OFFSET_OFFSET5_POSITION              equ 0005h
OPA4OFFSET_OFFSET5_SIZE                  equ 0001h
OPA4OFFSET_OFFSET5_LENGTH                equ 0001h
OPA4OFFSET_OFFSET5_MASK                  equ 0020h
OPA4OFFSET_OFFSET6_POSN                  equ 0006h
OPA4OFFSET_OFFSET6_POSITION              equ 0006h
OPA4OFFSET_OFFSET6_SIZE                  equ 0001h
OPA4OFFSET_OFFSET6_LENGTH                equ 0001h
OPA4OFFSET_OFFSET6_MASK                  equ 0040h
OPA4OFFSET_OFFSET7_POSN                  equ 0007h
OPA4OFFSET_OFFSET7_POSITION              equ 0007h
OPA4OFFSET_OFFSET7_SIZE                  equ 0001h
OPA4OFFSET_OFFSET7_LENGTH                equ 0001h
OPA4OFFSET_OFFSET7_MASK                  equ 0080h
OPA4OFFSET_OPA4OFFSET_POSN               equ 0000h
OPA4OFFSET_OPA4OFFSET_POSITION           equ 0000h
OPA4OFFSET_OPA4OFFSET_SIZE               equ 0008h
OPA4OFFSET_OPA4OFFSET_LENGTH             equ 0008h
OPA4OFFSET_OPA4OFFSET_MASK               equ 00FFh
OPA4OFFSET_OPA4OFFSET0_POSN              equ 0000h
OPA4OFFSET_OPA4OFFSET0_POSITION          equ 0000h
OPA4OFFSET_OPA4OFFSET0_SIZE              equ 0001h
OPA4OFFSET_OPA4OFFSET0_LENGTH            equ 0001h
OPA4OFFSET_OPA4OFFSET0_MASK              equ 0001h
OPA4OFFSET_OPA4OFFSET1_POSN              equ 0001h
OPA4OFFSET_OPA4OFFSET1_POSITION          equ 0001h
OPA4OFFSET_OPA4OFFSET1_SIZE              equ 0001h
OPA4OFFSET_OPA4OFFSET1_LENGTH            equ 0001h
OPA4OFFSET_OPA4OFFSET1_MASK              equ 0002h
OPA4OFFSET_OPA4OFFSET2_POSN              equ 0002h
OPA4OFFSET_OPA4OFFSET2_POSITION          equ 0002h
OPA4OFFSET_OPA4OFFSET2_SIZE              equ 0001h
OPA4OFFSET_OPA4OFFSET2_LENGTH            equ 0001h
OPA4OFFSET_OPA4OFFSET2_MASK              equ 0004h
OPA4OFFSET_OPA4OFFSET3_POSN              equ 0003h
OPA4OFFSET_OPA4OFFSET3_POSITION          equ 0003h
OPA4OFFSET_OPA4OFFSET3_SIZE              equ 0001h
OPA4OFFSET_OPA4OFFSET3_LENGTH            equ 0001h
OPA4OFFSET_OPA4OFFSET3_MASK              equ 0008h
OPA4OFFSET_OPA4OFFSET4_POSN              equ 0004h
OPA4OFFSET_OPA4OFFSET4_POSITION          equ 0004h
OPA4OFFSET_OPA4OFFSET4_SIZE              equ 0001h
OPA4OFFSET_OPA4OFFSET4_LENGTH            equ 0001h
OPA4OFFSET_OPA4OFFSET4_MASK              equ 0010h
OPA4OFFSET_OPA4OFFSET5_POSN              equ 0005h
OPA4OFFSET_OPA4OFFSET5_POSITION          equ 0005h
OPA4OFFSET_OPA4OFFSET5_SIZE              equ 0001h
OPA4OFFSET_OPA4OFFSET5_LENGTH            equ 0001h
OPA4OFFSET_OPA4OFFSET5_MASK              equ 0020h
OPA4OFFSET_OPA4OFFSET6_POSN              equ 0006h
OPA4OFFSET_OPA4OFFSET6_POSITION          equ 0006h
OPA4OFFSET_OPA4OFFSET6_SIZE              equ 0001h
OPA4OFFSET_OPA4OFFSET6_LENGTH            equ 0001h
OPA4OFFSET_OPA4OFFSET6_MASK              equ 0040h
OPA4OFFSET_OPA4OFFSET7_POSN              equ 0007h
OPA4OFFSET_OPA4OFFSET7_POSITION          equ 0007h
OPA4OFFSET_OPA4OFFSET7_SIZE              equ 0001h
OPA4OFFSET_OPA4OFFSET7_LENGTH            equ 0001h
OPA4OFFSET_OPA4OFFSET7_MASK              equ 0080h

// Register: OPA4CON4
#define OPA4CON4 OPA4CON4
OPA4CON4                                 equ 0A90h
// bitfield definitions
OPA4CON4_OFCSEL_POSN                     equ 0000h
OPA4CON4_OFCSEL_POSITION                 equ 0000h
OPA4CON4_OFCSEL_SIZE                     equ 0002h
OPA4CON4_OFCSEL_LENGTH                   equ 0002h
OPA4CON4_OFCSEL_MASK                     equ 0003h
OPA4CON4_OFCST_POSN                      equ 0002h
OPA4CON4_OFCST_POSITION                  equ 0002h
OPA4CON4_OFCST_SIZE                      equ 0001h
OPA4CON4_OFCST_LENGTH                    equ 0001h
OPA4CON4_OFCST_MASK                      equ 0004h
OPA4CON4_OFCSEL0_POSN                    equ 0000h
OPA4CON4_OFCSEL0_POSITION                equ 0000h
OPA4CON4_OFCSEL0_SIZE                    equ 0001h
OPA4CON4_OFCSEL0_LENGTH                  equ 0001h
OPA4CON4_OFCSEL0_MASK                    equ 0001h
OPA4CON4_OFCSEL1_POSN                    equ 0001h
OPA4CON4_OFCSEL1_POSITION                equ 0001h
OPA4CON4_OFCSEL1_SIZE                    equ 0001h
OPA4CON4_OFCSEL1_LENGTH                  equ 0001h
OPA4CON4_OFCSEL1_MASK                    equ 0002h
OPA4CON4_OPA4OFCSEL_POSN                 equ 0000h
OPA4CON4_OPA4OFCSEL_POSITION             equ 0000h
OPA4CON4_OPA4OFCSEL_SIZE                 equ 0002h
OPA4CON4_OPA4OFCSEL_LENGTH               equ 0002h
OPA4CON4_OPA4OFCSEL_MASK                 equ 0003h
OPA4CON4_OPA4OFCST_POSN                  equ 0002h
OPA4CON4_OPA4OFCST_POSITION              equ 0002h
OPA4CON4_OPA4OFCST_SIZE                  equ 0001h
OPA4CON4_OPA4OFCST_LENGTH                equ 0001h
OPA4CON4_OPA4OFCST_MASK                  equ 0004h
OPA4CON4_OPA4OFCSEL0_POSN                equ 0000h
OPA4CON4_OPA4OFCSEL0_POSITION            equ 0000h
OPA4CON4_OPA4OFCSEL0_SIZE                equ 0001h
OPA4CON4_OPA4OFCSEL0_LENGTH              equ 0001h
OPA4CON4_OPA4OFCSEL0_MASK                equ 0001h
OPA4CON4_OPA4OFCSEL1_POSN                equ 0001h
OPA4CON4_OPA4OFCSEL1_POSITION            equ 0001h
OPA4CON4_OPA4OFCSEL1_SIZE                equ 0001h
OPA4CON4_OPA4OFCSEL1_LENGTH              equ 0001h
OPA4CON4_OPA4OFCSEL1_MASK                equ 0002h

