garyPenhook/PIC-Assembler/device_includes/pic16f17576.inc
// Register: APMSTART2H
#define APMSTART2H APMSTART2H
APMSTART2H                               equ 01F57h
// bitfield definitions
APMSTART2H_START2_POSN                   equ 0000h
APMSTART2H_START2_POSITION               equ 0000h
APMSTART2H_START2_SIZE                   equ 0008h
APMSTART2H_START2_LENGTH                 equ 0008h
APMSTART2H_START2_MASK                   equ 00FFh

// Register: APMSTART2U
#define APMSTART2U APMSTART2U
APMSTART2U                               equ 01F58h
// bitfield definitions
APMSTART2U_START2_POSN                   equ 0000h
APMSTART2U_START2_POSITION               equ 0000h
APMSTART2U_START2_SIZE                   equ 0008h
APMSTART2U_START2_LENGTH                 equ 0008h
APMSTART2U_START2_MASK                   equ 00FFh

// Register: APMPERS2L
#define APMPERS2L APMPERS2L
APMPERS2L                                equ 01F59h
// bitfield definitions
APMPERS2L_APMPERS2_POSN                  equ 0000h
APMPERS2L_APMPERS2_POSITION              equ 0000h
APMPERS2L_APMPERS2_SIZE                  equ 0008h
APMPERS2L_APMPERS2_LENGTH                equ 0008h
APMPERS2L_APMPERS2_MASK                  equ 00FFh
APMPERS2L_SOSC_POSN                      equ 0000h
APMPERS2L_SOSC_POSITION                  equ 0000h
APMPERS2L_SOSC_SIZE                      equ 0001h
APMPERS2L_SOSC_LENGTH                    equ 0001h
APMPERS2L_SOSC_MASK                      equ 0001h
APMPERS2L_POSC_POSN                      equ 0001h
APMPERS2L_POSC_POSITION                  equ 0001h
APMPERS2L_POSC_SIZE                      equ 0001h
APMPERS2L_POSC_LENGTH                    equ 0001h
APMPERS2L_POSC_MASK                      equ 0002h
APMPERS2L_BG_POSN                        equ 0002h
APMPERS2L_BG_POSITION                    equ 0002h
APMPERS2L_BG_SIZE                        equ 0001h
APMPERS2L_BG_LENGTH                      equ 0001h
APMPERS2L_BG_MASK                        equ 0004h
APMPERS2L_FVR1_POSN                      equ 0003h
APMPERS2L_FVR1_POSITION                  equ 0003h
APMPERS2L_FVR1_SIZE                      equ 0001h
APMPERS2L_FVR1_LENGTH                    equ 0001h
APMPERS2L_FVR1_MASK                      equ 0008h
APMPERS2L_FVR2_POSN                      equ 0004h
APMPERS2L_FVR2_POSITION                  equ 0004h
APMPERS2L_FVR2_SIZE                      equ 0001h
APMPERS2L_FVR2_LENGTH                    equ 0001h
APMPERS2L_FVR2_MASK                      equ 0010h
APMPERS2L_ADCD_POSN                      equ 0005h
APMPERS2L_ADCD_POSITION                  equ 0005h
APMPERS2L_ADCD_SIZE                      equ 0001h
APMPERS2L_ADCD_LENGTH                    equ 0001h
APMPERS2L_ADCD_MASK                      equ 0020h
APMPERS2L_ADCA_POSN                      equ 0006h
APMPERS2L_ADCA_POSITION                  equ 0006h
APMPERS2L_ADCA_SIZE                      equ 0001h
APMPERS2L_ADCA_LENGTH                    equ 0001h
APMPERS2L_ADCA_MASK                      equ 0040h
APMPERS2L_TEMP_POSN                      equ 0007h
APMPERS2L_TEMP_POSITION                  equ 0007h
APMPERS2L_TEMP_SIZE                      equ 0001h
APMPERS2L_TEMP_LENGTH                    equ 0001h
APMPERS2L_TEMP_MASK                      equ 0080h

// Register: APMPERS2H
#define APMPERS2H APMPERS2H
APMPERS2H                                equ 01F5Ah
// bitfield definitions
APMPERS2H_APMPERS2_POSN                  equ 0000h
APMPERS2H_APMPERS2_POSITION              equ 0000h
APMPERS2H_APMPERS2_SIZE                  equ 0008h
APMPERS2H_APMPERS2_LENGTH                equ 0008h
APMPERS2H_APMPERS2_MASK                  equ 00FFh
APMPERS2H_OPA1_POSN                      equ 0000h
APMPERS2H_OPA1_POSITION                  equ 0000h
APMPERS2H_OPA1_SIZE                      equ 0001h
APMPERS2H_OPA1_LENGTH                    equ 0001h
APMPERS2H_OPA1_MASK                      equ 0001h
APMPERS2H_OPA2_POSN                      equ 0001h
APMPERS2H_OPA2_POSITION                  equ 0001h
APMPERS2H_OPA2_SIZE                      equ 0001h
APMPERS2H_OPA2_LENGTH                    equ 0001h
APMPERS2H_OPA2_MASK                      equ 0002h
APMPERS2H_DAC1_POSN                      equ 0002h
APMPERS2H_DAC1_POSITION                  equ 0002h
APMPERS2H_DAC1_SIZE                      equ 0001h
APMPERS2H_DAC1_LENGTH                    equ 0001h
APMPERS2H_DAC1_MASK                      equ 0004h
APMPERS2H_DAC2_POSN                      equ 0003h
APMPERS2H_DAC2_POSITION                  equ 0003h
APMPERS2H_DAC2_SIZE                      equ 0001h
APMPERS2H_DAC2_LENGTH                    equ 0001h
APMPERS2H_DAC2_MASK                      equ 0008h
APMPERS2H_CMP1_POSN                      equ 0005h
APMPERS2H_CMP1_POSITION                  equ 0005h
APMPERS2H_CMP1_SIZE                      equ 0001h
APMPERS2H_CMP1_LENGTH                    equ 0001h
APMPERS2H_CMP1_MASK                      equ 0020h
APMPERS2H_CMPLP1_POSN                    equ 0006h
APMPERS2H_CMPLP1_POSITION                equ 0006h
APMPERS2H_CMPLP1_SIZE                    equ 0001h
APMPERS2H_CMPLP1_LENGTH                  equ 0001h
APMPERS2H_CMPLP1_MASK                    equ 0040h
APMPERS2H_ZCD_POSN                       equ 0007h
APMPERS2H_ZCD_POSITION                   equ 0007h
APMPERS2H_ZCD_SIZE                       equ 0001h
APMPERS2H_ZCD_LENGTH                     equ 0001h
APMPERS2H_ZCD_MASK                       equ 0080h

// Register: APMPERS2U
#define APMPERS2U APMPERS2U
APMPERS2U                                equ 01F5Bh
// bitfield definitions
APMPERS2U_APMPERS2_POSN                  equ 0000h
APMPERS2U_APMPERS2_POSITION              equ 0000h
APMPERS2U_APMPERS2_SIZE                  equ 0008h
APMPERS2U_APMPERS2_LENGTH                equ 0008h
APMPERS2U_APMPERS2_MASK                  equ 00FFh
APMPERS2U_OPA3_POSN                      equ 0000h
APMPERS2U_OPA3_POSITION                  equ 0000h
APMPERS2U_OPA3_SIZE                      equ 0001h
APMPERS2U_OPA3_LENGTH                    equ 0001h
APMPERS2U_OPA3_MASK                      equ 0001h
APMPERS2U_OPA4_POSN                      equ 0001h
APMPERS2U_OPA4_POSITION                  equ 0001h
APMPERS2U_OPA4_SIZE                      equ 0001h
APMPERS2U_OPA4_LENGTH                    equ 0001h
APMPERS2U_OPA4_MASK                      equ 0002h
APMPERS2U_VREFLPDAC_POSN                 equ 0006h
APMPERS2U_VREFLPDAC_POSITION             equ 0006h
APMPERS2U_VREFLPDAC_SIZE                 equ 0001h
APMPERS2U_VREFLPDAC_LENGTH               equ 0001h
APMPERS2U_VREFLPDAC_MASK                 equ 0040h
APMPERS2U_VREFLP_POSN                    equ 0007h
APMPERS2U_VREFLP_POSITION                equ 0007h
APMPERS2U_VREFLP_SIZE                    equ 0001h
APMPERS2U_VREFLP_LENGTH                  equ 0001h
APMPERS2U_VREFLP_MASK                    equ 0080h

