garyPenhook/PIC-Assembler/device_includes/pic16f17576.inc
#define IOCWF1                           BANKMASK(IOCWF), 1
#define IOCWF2                           BANKMASK(IOCWF), 2
#define IOCWF3                           BANKMASK(IOCWF), 3
#define IOCWF4                           BANKMASK(IOCWF), 4
#define IOCWF5                           BANKMASK(IOCWF), 5
#define IOCWF6                           BANKMASK(IOCWF), 6
#define IOCWF7                           BANKMASK(IOCWF), 7
#define IOCWN0                           BANKMASK(IOCWN), 0
#define IOCWN1                           BANKMASK(IOCWN), 1
#define IOCWN2                           BANKMASK(IOCWN), 2
#define IOCWN3                           BANKMASK(IOCWN), 3
#define IOCWN4                           BANKMASK(IOCWN), 4
#define IOCWN5                           BANKMASK(IOCWN), 5
#define IOCWN6                           BANKMASK(IOCWN), 6
#define IOCWN7                           BANKMASK(IOCWN), 7
#define IOCWP0                           BANKMASK(IOCWP), 0
#define IOCWP1                           BANKMASK(IOCWP), 1
#define IOCWP2                           BANKMASK(IOCWP), 2
#define IOCWP3                           BANKMASK(IOCWP), 3
#define IOCWP4                           BANKMASK(IOCWP), 4
#define IOCWP5                           BANKMASK(IOCWP), 5
#define IOCWP6                           BANKMASK(IOCWP), 6
#define IOCWP7                           BANKMASK(IOCWP), 7
#define IPEN                             BANKMASK(ADCON1), 6
#define ISM0                             BANKMASK(CWG1ISM), 0
#define ISM1                             BANKMASK(CWG1ISM), 1
#define ISM2                             BANKMASK(CWG1ISM), 2
#define ISM3                             BANKMASK(CWG1ISM), 3
#define ISM4                             BANKMASK(CWG1ISM), 4
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA3                            BANKMASK(LATA), 3
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LATA6                            BANKMASK(LATA), 6
#define LATA7                            BANKMASK(LATA), 7
#define LATB0                            BANKMASK(LATB), 0
#define LATB1                            BANKMASK(LATB), 1
#define LATB2                            BANKMASK(LATB), 2
#define LATB3                            BANKMASK(LATB), 3
#define LATB4                            BANKMASK(LATB), 4
#define LATB5                            BANKMASK(LATB), 5
#define LATB6                            BANKMASK(LATB), 6
#define LATB7                            BANKMASK(LATB), 7
#define LATC0                            BANKMASK(LATC), 0
#define LATC1                            BANKMASK(LATC), 1
#define LATC2                            BANKMASK(LATC), 2
#define LATC3                            BANKMASK(LATC), 3
#define LATC4                            BANKMASK(LATC), 4
#define LATC5                            BANKMASK(LATC), 5
#define LATC6                            BANKMASK(LATC), 6
#define LATC7                            BANKMASK(LATC), 7
#define LATD0                            BANKMASK(LATD), 0
#define LATD1                            BANKMASK(LATD), 1
#define LATD2                            BANKMASK(LATD), 2
#define LATD3                            BANKMASK(LATD), 3
#define LATD4                            BANKMASK(LATD), 4
#define LATD5                            BANKMASK(LATD), 5
#define LATD6                            BANKMASK(LATD), 6
#define LATD7                            BANKMASK(LATD), 7
#define LATE0                            BANKMASK(LATE), 0
#define LATE1                            BANKMASK(LATE), 1
#define LATE2                            BANKMASK(LATE), 2
#define LATW0                            BANKMASK(LATW), 0
#define LATW1                            BANKMASK(LATW), 1
#define LATW2                            BANKMASK(LATW), 2
#define LATW3                            BANKMASK(LATW), 3
#define LATW4                            BANKMASK(LATW), 4
#define LATW5                            BANKMASK(LATW), 5
#define LATW6                            BANKMASK(LATW), 6
#define LATW7                            BANKMASK(LATW), 7
#define LENDIAN                          BANKMASK(CRCCON0), 1
#define LFOEN                            BANKMASK(OSCEN), 4
#define LFOR                             BANKMASK(OSCSTAT), 4
#define LSAC0                            BANKMASK(CWG1AS0), 2
#define LSBD0                            BANKMASK(CWG1AS0), 4
#define LSBD1                            BANKMASK(CWG1AS0), 5
#define LSCA1                            BANKMASK(CWG1AS0), 3
#define LTH0                             BANKMASK(ADLTHL), 0
#define LTH1                             BANKMASK(ADLTHL), 1
#define LTH10                            BANKMASK(ADLTHH), 2
#define LTH11                            BANKMASK(ADLTHH), 3
#define LTH12                            BANKMASK(ADLTHH), 4
#define LTH13                            BANKMASK(ADLTHH), 5
#define LTH14                            BANKMASK(ADLTHH), 6
#define LTH15                            BANKMASK(ADLTHH), 7
#define LTH2                             BANKMASK(ADLTHL), 2
#define LTH3                             BANKMASK(ADLTHL), 3
#define LTH4                             BANKMASK(ADLTHL), 4
#define LTH5                             BANKMASK(ADLTHL), 5
#define LTH6                             BANKMASK(ADLTHL), 6
#define LTH7                             BANKMASK(ADLTHL), 7
#define LTH8                             BANKMASK(ADLTHH), 0
#define LTH9                             BANKMASK(ADLTHH), 1
#define LTHR                             BANKMASK(ADSTAT), 5
#define LWLO                             BANKMASK(NVMCON1), 5
#define MATH                             BANKMASK(ADSTAT), 4
#define MD0                              BANKMASK(ADCON2), 0
#define MD1                              BANKMASK(ADCON2), 1
#define MD16                             BANKMASK(T0CON0), 4
#define MD2                              BANKMASK(ADCON2), 2
#define MFOEN                            BANKMASK(OSCEN), 5
#define MFOR                             BANKMASK(OSCSTAT), 5
#define MPWM1EN                          BANKMASK(PWMEN), 0
#define MPWM1LD                          BANKMASK(PWMLOAD), 0
#define MPWM2EN                          BANKMASK(PWMEN), 1
#define MPWM2LD                          BANKMASK(PWMLOAD), 1
#define MSK01                            BANKMASK(SSP1ADD), 0
#define MSK02                            BANKMASK(SSP2ADD), 0
#define MSK11                            BANKMASK(SSP1ADD), 1
#define MSK12                            BANKMASK(SSP2ADD), 1
#define MSK21                            BANKMASK(SSP1ADD), 2
#define MSK22                            BANKMASK(SSP2ADD), 2
#define MSK31                            BANKMASK(SSP1ADD), 3
#define MSK32                            BANKMASK(SSP2ADD), 3
#define MSK41                            BANKMASK(SSP1ADD), 4
#define MSK42                            BANKMASK(SSP2ADD), 4
#define MSK51                            BANKMASK(SSP1ADD), 5
#define MSK52                            BANKMASK(SSP2ADD), 5
#define MSK61                            BANKMASK(SSP1ADD), 6
#define MSK62                            BANKMASK(SSP2ADD), 6
#define MSK71                            BANKMASK(SSP1ADD), 7
#define MSK72                            BANKMASK(SSP2ADD), 7
#define MSSP1MD                          BANKMASK(PMD3), 3
#define MSSP2MD                          BANKMASK(PMD3), 4
#define NCH4                             BANKMASK(ADNCH), 4
#define NCH5                             BANKMASK(ADNCH), 5
#define NCO1ACC0                         BANKMASK(NCO1ACCL), 0
#define NCO1ACC1                         BANKMASK(NCO1ACCL), 1
#define NCO1ACC10                        BANKMASK(NCO1ACCH), 2
#define NCO1ACC11                        BANKMASK(NCO1ACCH), 3
#define NCO1ACC12                        BANKMASK(NCO1ACCH), 4
#define NCO1ACC13                        BANKMASK(NCO1ACCH), 5
#define NCO1ACC14                        BANKMASK(NCO1ACCH), 6
#define NCO1ACC15                        BANKMASK(NCO1ACCH), 7
#define NCO1ACC16                        BANKMASK(NCO1ACCU), 0
#define NCO1ACC17                        BANKMASK(NCO1ACCU), 1
#define NCO1ACC18                        BANKMASK(NCO1ACCU), 2
#define NCO1ACC19                        BANKMASK(NCO1ACCU), 3
#define NCO1ACC2                         BANKMASK(NCO1ACCL), 2
#define NCO1ACC3                         BANKMASK(NCO1ACCL), 3
#define NCO1ACC4                         BANKMASK(NCO1ACCL), 4
#define NCO1ACC5                         BANKMASK(NCO1ACCL), 5
#define NCO1ACC6                         BANKMASK(NCO1ACCL), 6
#define NCO1ACC7                         BANKMASK(NCO1ACCL), 7
#define NCO1ACC8                         BANKMASK(NCO1ACCH), 0
#define NCO1ACC9                         BANKMASK(NCO1ACCH), 1
#define NCO1CKS0                         BANKMASK(NCO1CLK), 0
#define NCO1CKS1                         BANKMASK(NCO1CLK), 1
#define NCO1CKS2                         BANKMASK(NCO1CLK), 2
#define NCO1CKS3                         BANKMASK(NCO1CLK), 3
#define NCO1EN                           BANKMASK(NCO1CON), 7
#define NCO1IE                           BANKMASK(PIE4), 0
#define NCO1IF                           BANKMASK(PIR4), 0
#define NCO1INC0                         BANKMASK(NCO1INCL), 0
#define NCO1INC1                         BANKMASK(NCO1INCL), 1
#define NCO1INC10                        BANKMASK(NCO1INCH), 2
#define NCO1INC11                        BANKMASK(NCO1INCH), 3
#define NCO1INC12                        BANKMASK(NCO1INCH), 4
#define NCO1INC13                        BANKMASK(NCO1INCH), 5
#define NCO1INC14                        BANKMASK(NCO1INCH), 6
#define NCO1INC15                        BANKMASK(NCO1INCH), 7
#define NCO1INC16                        BANKMASK(NCO1INCU), 0
#define NCO1INC17                        BANKMASK(NCO1INCU), 1
#define NCO1INC18                        BANKMASK(NCO1INCU), 2
#define NCO1INC19                        BANKMASK(NCO1INCU), 3
#define NCO1INC2                         BANKMASK(NCO1INCL), 2
#define NCO1INC3                         BANKMASK(NCO1INCL), 3
#define NCO1INC4                         BANKMASK(NCO1INCL), 4
#define NCO1INC5                         BANKMASK(NCO1INCL), 5
#define NCO1INC6                         BANKMASK(NCO1INCL), 6
#define NCO1INC7                         BANKMASK(NCO1INCL), 7
#define NCO1INC8                         BANKMASK(NCO1INCH), 0
#define NCO1INC9                         BANKMASK(NCO1INCH), 1
#define NCO1MD                           BANKMASK(PMD2), 1
#define NCO1OUT                          BANKMASK(NCO1CON), 5
#define NCO1PFM                          BANKMASK(NCO1CON), 0
#define NCO1POL                          BANKMASK(NCO1CON), 4
#define NCO1PWS0                         BANKMASK(NCO1CLK), 5
#define NCO1PWS1                         BANKMASK(NCO1CLK), 6
#define NCO1PWS2                         BANKMASK(NCO1CLK), 7
#define NDIV0                            BANKMASK(OSCCON1), 0
#define NDIV1                            BANKMASK(OSCCON1), 1
#define NDIV2                            BANKMASK(OSCCON1), 2
#define NDIV3                            BANKMASK(OSCCON1), 3
#define NOSC0                            BANKMASK(OSCCON1), 4
#define NOSC1                            BANKMASK(OSCCON1), 5
#define NOSC2                            BANKMASK(OSCCON1), 6
#define NOSCR                            BANKMASK(OSCCON3), 3
#define NREF0                            BANKMASK(ADREF), 4
#define NVMADR0                          BANKMASK(NVMADRL), 0
#define NVMADR1                          BANKMASK(NVMADRL), 1
#define NVMADR10                         BANKMASK(NVMADRH), 2
#define NVMADR11                         BANKMASK(NVMADRH), 3
#define NVMADR12                         BANKMASK(NVMADRH), 4
#define NVMADR13                         BANKMASK(NVMADRH), 5
#define NVMADR14                         BANKMASK(NVMADRH), 6
#define NVMADR2                          BANKMASK(NVMADRL), 2
#define NVMADR3                          BANKMASK(NVMADRL), 3
#define NVMADR4                          BANKMASK(NVMADRL), 4
#define NVMADR5                          BANKMASK(NVMADRL), 5
#define NVMADR6                          BANKMASK(NVMADRL), 6
#define NVMADR7                          BANKMASK(NVMADRL), 7
#define NVMADR8                          BANKMASK(NVMADRH), 0
#define NVMADR9                          BANKMASK(NVMADRH), 1
#define NVMDAT0                          BANKMASK(NVMDATL), 0
#define NVMDAT1                          BANKMASK(NVMDATL), 1
#define NVMDAT10                         BANKMASK(NVMDATH), 2
#define NVMDAT11                         BANKMASK(NVMDATH), 3
#define NVMDAT12                         BANKMASK(NVMDATH), 4
#define NVMDAT13                         BANKMASK(NVMDATH), 5
#define NVMDAT2                          BANKMASK(NVMDATL), 2
#define NVMDAT3                          BANKMASK(NVMDATL), 3
#define NVMDAT4                          BANKMASK(NVMDATL), 4
#define NVMDAT5                          BANKMASK(NVMDATL), 5
#define NVMDAT6                          BANKMASK(NVMDATL), 6
#define NVMDAT7                          BANKMASK(NVMDATL), 7
#define NVMDAT8                          BANKMASK(NVMDATH), 0
#define NVMDAT9                          BANKMASK(NVMDATH), 1
#define NVMIE                            BANKMASK(PIE1), 0
#define NVMIF                            BANKMASK(PIR1), 0
#define NVMMD                            BANKMASK(PMD0), 0
#define NVMREGS                          BANKMASK(NVMCON1), 6
#define ODCA0                            BANKMASK(ODCONA), 0
#define ODCA1                            BANKMASK(ODCONA), 1
#define ODCA2                            BANKMASK(ODCONA), 2
#define ODCA3                            BANKMASK(ODCONA), 3
#define ODCA4                            BANKMASK(ODCONA), 4
#define ODCA5                            BANKMASK(ODCONA), 5
#define ODCA6                            BANKMASK(ODCONA), 6
#define ODCA7                            BANKMASK(ODCONA), 7
#define ODCB0                            BANKMASK(ODCONB), 0
#define ODCB1                            BANKMASK(ODCONB), 1
#define ODCB2                            BANKMASK(ODCONB), 2
#define ODCB3                            BANKMASK(ODCONB), 3
#define ODCB4                            BANKMASK(ODCONB), 4
#define ODCB5                            BANKMASK(ODCONB), 5
#define ODCB6                            BANKMASK(ODCONB), 6
#define ODCB7                            BANKMASK(ODCONB), 7
#define ODCC0                            BANKMASK(ODCONC), 0
#define ODCC1                            BANKMASK(ODCONC), 1
#define ODCC2                            BANKMASK(ODCONC), 2
#define ODCC3                            BANKMASK(ODCONC), 3
#define ODCC4                            BANKMASK(ODCONC), 4
#define ODCC5                            BANKMASK(ODCONC), 5
#define ODCC6                            BANKMASK(ODCONC), 6
#define ODCC7                            BANKMASK(ODCONC), 7
#define ODCD0                            BANKMASK(ODCOND), 0
#define ODCD1                            BANKMASK(ODCOND), 1
#define ODCD2                            BANKMASK(ODCOND), 2
#define ODCD3                            BANKMASK(ODCOND), 3
#define ODCD4                            BANKMASK(ODCOND), 4
#define ODCD5                            BANKMASK(ODCOND), 5
#define ODCD6                            BANKMASK(ODCOND), 6
#define ODCD7                            BANKMASK(ODCOND), 7
#define ODCE0                            BANKMASK(ODCONE), 0
#define ODCE1                            BANKMASK(ODCONE), 1
#define ODCE2                            BANKMASK(ODCONE), 2
#define OPA1CIE                          BANKMASK(PIE7), 0
#define OPA1CIF                          BANKMASK(PIR7), 0
#define OPA1EN                           BANKMASK(OPA1CON0), 7
#define OPA1FMS0                         BANKMASK(OPA1CON2), 6
#define OPA1FMS1                         BANKMASK(OPA1CON2), 7
#define OPA1GSEL0                        BANKMASK(OPA1CON1), 4
#define OPA1GSEL1                        BANKMASK(OPA1CON1), 5
#define OPA1GSEL2                        BANKMASK(OPA1CON1), 6
#define OPA1MD                           BANKMASK(PMD4), 3
#define OPA1NCH0                         BANKMASK(OPA1CON3), 0
#define OPA1NCH1                         BANKMASK(OPA1CON3), 1
#define OPA1NCH2                         BANKMASK(OPA1CON3), 2
#define OPA1NCH3                         BANKMASK(OPA1CON3), 3
#define OPA1NSS0                         BANKMASK(OPA1CON1), 0
#define OPA1NSS1                         BANKMASK(OPA1CON1), 1
#define OPA1NSS2                         BANKMASK(OPA1CON1), 2
#define OPA1OFCSEL0                      BANKMASK(OPA1CON4), 0
#define OPA1OFCSEL1                      BANKMASK(OPA1CON4), 1
#define OPA1OFCST                        BANKMASK(OPA1CON4), 2
#define OPA1OFFSET0                      BANKMASK(OPA1OFFSET), 0
#define OPA1OFFSET1                      BANKMASK(OPA1OFFSET), 1
#define OPA1OFFSET2                      BANKMASK(OPA1OFFSET), 2
#define OPA1OFFSET3                      BANKMASK(OPA1OFFSET), 3
#define OPA1OFFSET4                      BANKMASK(OPA1OFFSET), 4
#define OPA1OFFSET5                      BANKMASK(OPA1OFFSET), 5
#define OPA1OFFSET6                      BANKMASK(OPA1OFFSET), 6
#define OPA1OFFSET7                      BANKMASK(OPA1OFFSET), 7
#define OPA1PCH0                         BANKMASK(OPA1CON2), 0
#define OPA1PCH1                         BANKMASK(OPA1CON2), 1
#define OPA1PCH2                         BANKMASK(OPA1CON2), 2
#define OPA1PCH3                         BANKMASK(OPA1CON2), 3
#define OPA1RESON                        BANKMASK(OPA1CON1), 3
#define OPA1UG                           BANKMASK(OPA1CON0), 3
#define OPA2CIE                          BANKMASK(PIE7), 1
#define OPA2CIF                          BANKMASK(PIR7), 1
#define OPA2EN                           BANKMASK(OPA2CON0), 7
#define OPA2FMS0                         BANKMASK(OPA2CON2), 6
#define OPA2FMS1                         BANKMASK(OPA2CON2), 7
#define OPA2GSEL0                        BANKMASK(OPA2CON1), 4
#define OPA2GSEL1                        BANKMASK(OPA2CON1), 5
#define OPA2GSEL2                        BANKMASK(OPA2CON1), 6
#define OPA2MD                           BANKMASK(PMD4), 4
#define OPA2NCH0                         BANKMASK(OPA2CON3), 0
#define OPA2NCH1                         BANKMASK(OPA2CON3), 1
#define OPA2NCH2                         BANKMASK(OPA2CON3), 2
#define OPA2NCH3                         BANKMASK(OPA2CON3), 3
#define OPA2NSS0                         BANKMASK(OPA2CON1), 0
#define OPA2NSS1                         BANKMASK(OPA2CON1), 1
#define OPA2NSS2                         BANKMASK(OPA2CON1), 2
#define OPA2OFCSEL0                      BANKMASK(OPA2CON4), 0
#define OPA2OFCSEL1                      BANKMASK(OPA2CON4), 1
#define OPA2OFCST                        BANKMASK(OPA2CON4), 2
#define OPA2OFFSET0                      BANKMASK(OPA2OFFSET), 0
#define OPA2OFFSET1                      BANKMASK(OPA2OFFSET), 1
#define OPA2OFFSET2                      BANKMASK(OPA2OFFSET), 2
#define OPA2OFFSET3                      BANKMASK(OPA2OFFSET), 3
#define OPA2OFFSET4                      BANKMASK(OPA2OFFSET), 4
#define OPA2OFFSET5                      BANKMASK(OPA2OFFSET), 5
#define OPA2OFFSET6                      BANKMASK(OPA2OFFSET), 6
#define OPA2OFFSET7                      BANKMASK(OPA2OFFSET), 7
#define OPA2PCH0                         BANKMASK(OPA2CON2), 0
#define OPA2PCH1                         BANKMASK(OPA2CON2), 1
#define OPA2PCH2                         BANKMASK(OPA2CON2), 2
#define OPA2PCH3                         BANKMASK(OPA2CON2), 3
#define OPA2RESON                        BANKMASK(OPA2CON1), 3
#define OPA2UG                           BANKMASK(OPA2CON0), 3
#define OPA3CIE                          BANKMASK(PIE7), 2
#define OPA3CIF                          BANKMASK(PIR7), 2
#define OPA3EN                           BANKMASK(OPA3CON0), 7
#define OPA3MD                           BANKMASK(PMD4), 5
#define OPA3NCH0                         BANKMASK(OPA3CON3), 0
#define OPA3NCH1                         BANKMASK(OPA3CON3), 1
#define OPA3NCH2                         BANKMASK(OPA3CON3), 2
#define OPA3OFCSEL0                      BANKMASK(OPA3CON4), 0
#define OPA3OFCSEL1                      BANKMASK(OPA3CON4), 1
#define OPA3OFCST                        BANKMASK(OPA3CON4), 2
#define OPA3OFFSET0                      BANKMASK(OPA3OFFSET), 0
#define OPA3OFFSET1                      BANKMASK(OPA3OFFSET), 1
#define OPA3OFFSET2                      BANKMASK(OPA3OFFSET), 2
#define OPA3OFFSET3                      BANKMASK(OPA3OFFSET), 3
#define OPA3OFFSET4                      BANKMASK(OPA3OFFSET), 4
#define OPA3OFFSET5                      BANKMASK(OPA3OFFSET), 5
#define OPA3OFFSET6                      BANKMASK(OPA3OFFSET), 6
#define OPA3OFFSET7                      BANKMASK(OPA3OFFSET), 7
#define OPA3PCH0                         BANKMASK(OPA3CON2), 0
#define OPA3PCH1                         BANKMASK(OPA3CON2), 1
#define OPA3PCH2                         BANKMASK(OPA3CON2), 2
#define OPA3UG                           BANKMASK(OPA3CON0), 3
#define OPA4CIE                          BANKMASK(PIE7), 3
#define OPA4CIF                          BANKMASK(PIR7), 3
#define OPA4EN                           BANKMASK(OPA4CON0), 7
#define OPA4MD                           BANKMASK(PMD4), 6
#define OPA4NCH0                         BANKMASK(OPA4CON3), 0
#define OPA4NCH1                         BANKMASK(OPA4CON3), 1
#define OPA4NCH2                         BANKMASK(OPA4CON3), 2
#define OPA4OFCSEL0                      BANKMASK(OPA4CON4), 0
#define OPA4OFCSEL1                      BANKMASK(OPA4CON4), 1
#define OPA4OFCST                        BANKMASK(OPA4CON4), 2
#define OPA4OFFSET0                      BANKMASK(OPA4OFFSET), 0
#define OPA4OFFSET1                      BANKMASK(OPA4OFFSET), 1
#define OPA4OFFSET2                      BANKMASK(OPA4OFFSET), 2
#define OPA4OFFSET3                      BANKMASK(OPA4OFFSET), 3
#define OPA4OFFSET4                      BANKMASK(OPA4OFFSET), 4
#define OPA4OFFSET5                      BANKMASK(OPA4OFFSET), 5
#define OPA4OFFSET6                      BANKMASK(OPA4OFFSET), 6
#define OPA4OFFSET7                      BANKMASK(OPA4OFFSET), 7
#define OPA4PCH0                         BANKMASK(OPA4CON2), 0
#define OPA4PCH1                         BANKMASK(OPA4CON2), 1
#define OPA4PCH2                         BANKMASK(OPA4CON2), 2
#define OPA4UG                           BANKMASK(OPA4CON0), 3
#define ORDY                             BANKMASK(OSCCON3), 4
#define OSC0                             BANKMASK(ADCLK), 6
#define OSC1                             BANKMASK(ADCLK), 7
#define OSFIE                            BANKMASK(PIE1), 5
#define OSFIF                            BANKMASK(PIR1), 5
#define OUT0                             BANKMASK(CRCOUTL), 0
#define OUT1                             BANKMASK(CRCOUTL), 1
#define OUT10                            BANKMASK(CRCOUTH), 2
#define OUT11                            BANKMASK(CRCOUTH), 3
#define OUT12                            BANKMASK(CRCOUTH), 4
#define OUT13                            BANKMASK(CRCOUTH), 5
#define OUT14                            BANKMASK(CRCOUTH), 6
#define OUT15                            BANKMASK(CRCOUTH), 7
#define OUT16                            BANKMASK(CRCOUTU), 0
#define OUT17                            BANKMASK(CRCOUTU), 1
#define OUT18                            BANKMASK(CRCOUTU), 2
#define OUT19                            BANKMASK(CRCOUTU), 3
#define OUT2                             BANKMASK(CRCOUTL), 2
#define OUT20                            BANKMASK(CRCOUTU), 4
