garyPenhook/PIC-Assembler/device_includes/pic16f17576.inc
#define T0CKPS1                          BANKMASK(T0CON1), 1
#define T0CKPS2                          BANKMASK(T0CON1), 2
#define T0CKPS3                          BANKMASK(T0CON1), 3
#define T0CS0                            BANKMASK(T0CON1), 5
#define T0CS1                            BANKMASK(T0CON1), 6
#define T0CS2                            BANKMASK(T0CON1), 7
#define T0EN                             BANKMASK(T0CON0), 7
#define T0MD16                           BANKMASK(T0CON0), 4
#define T0OUT                            BANKMASK(T0CON0), 5
#define T0OUTPS0                         BANKMASK(T0CON0), 0
#define T0OUTPS1                         BANKMASK(T0CON0), 1
#define T0OUTPS2                         BANKMASK(T0CON0), 2
#define T0OUTPS3                         BANKMASK(T0CON0), 3
#define T0PR0                            BANKMASK(TMR0H), 0
#define T0PR1                            BANKMASK(TMR0H), 1
#define T0PR2                            BANKMASK(TMR0H), 2
#define T0PR3                            BANKMASK(TMR0H), 3
#define T0PR4                            BANKMASK(TMR0H), 4
#define T0PR5                            BANKMASK(TMR0H), 5
#define T0PR6                            BANKMASK(TMR0H), 6
#define T0PR7                            BANKMASK(TMR0H), 7
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4
#define T1CKIPPS5                        BANKMASK(T1CKIPPS), 5
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1CS0                            BANKMASK(T1CLK), 0
#define T1CS1                            BANKMASK(T1CLK), 1
#define T1CS2                            BANKMASK(T1CLK), 2
#define T1CS3                            BANKMASK(T1CLK), 3
#define T1CS4                            BANKMASK(T1CLK), 4
#define T1GE                             BANKMASK(T1GCON), 7
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GPPS0                          BANKMASK(T1GPPS), 0
#define T1GPPS1                          BANKMASK(T1GPPS), 1
#define T1GPPS2                          BANKMASK(T1GPPS), 2
#define T1GPPS3                          BANKMASK(T1GPPS), 3
#define T1GPPS4                          BANKMASK(T1GPPS), 4
#define T1GPPS5                          BANKMASK(T1GPPS), 5
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GATE), 0
#define T1GSS1                           BANKMASK(T1GATE), 1
#define T1GSS2                           BANKMASK(T1GATE), 2
#define T1GSS3                           BANKMASK(T1GATE), 3
#define T1GSS4                           BANKMASK(T1GATE), 4
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1RD16                           BANKMASK(T1CON), 1
#define T2CKPS0                          BANKMASK(T2CON), 4
#define T2CKPS1                          BANKMASK(T2CON), 5
#define T2CKPS2                          BANKMASK(T2CON), 6
#define T2CPOL                           BANKMASK(T2HLT), 6
#define T2CS0                            BANKMASK(T2CLKCON), 0
#define T2CS1                            BANKMASK(T2CLKCON), 1
#define T2CS2                            BANKMASK(T2CLKCON), 2
#define T2CS3                            BANKMASK(T2CLKCON), 3
#define T2CSYNC                          BANKMASK(T2HLT), 5
#define T2INPPS0                         BANKMASK(T2INPPS), 0
#define T2INPPS1                         BANKMASK(T2INPPS), 1
#define T2INPPS2                         BANKMASK(T2INPPS), 2
#define T2INPPS3                         BANKMASK(T2INPPS), 3
#define T2INPPS4                         BANKMASK(T2INPPS), 4
#define T2INPPS5                         BANKMASK(T2INPPS), 5
#define T2MODE0                          BANKMASK(T2HLT), 0
#define T2MODE1                          BANKMASK(T2HLT), 1
#define T2MODE2                          BANKMASK(T2HLT), 2
#define T2MODE3                          BANKMASK(T2HLT), 3
#define T2MODE4                          BANKMASK(T2HLT), 4
#define T2ON                             BANKMASK(T2CON), 7
#define T2OUTPS0                         BANKMASK(T2CON), 0
#define T2OUTPS1                         BANKMASK(T2CON), 1
#define T2OUTPS2                         BANKMASK(T2CON), 2
#define T2OUTPS3                         BANKMASK(T2CON), 3
#define T2PSYNC                          BANKMASK(T2HLT), 7
#define T2RSEL0                          BANKMASK(T2RST), 0
#define T2RSEL1                          BANKMASK(T2RST), 1
#define T2RSEL2                          BANKMASK(T2RST), 2
#define T2RSEL3                          BANKMASK(T2RST), 3
#define T2RSEL4                          BANKMASK(T2RST), 4
#define T3CKPS0                          BANKMASK(T3CON), 4
#define T3CKPS1                          BANKMASK(T3CON), 5
#define T3CS0                            BANKMASK(T3CLK), 0
#define T3CS1                            BANKMASK(T3CLK), 1
#define T3CS2                            BANKMASK(T3CLK), 2
#define T3CS3                            BANKMASK(T3CLK), 3
#define T3CS4                            BANKMASK(T3CLK), 4
#define T3GE                             BANKMASK(T3GCON), 7
#define T3GGO                            BANKMASK(T3GCON), 3
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3
#define T3GPOL                           BANKMASK(T3GCON), 6
#define T3GSPM                           BANKMASK(T3GCON), 4
#define T3GSS0                           BANKMASK(T3GATE), 0
#define T3GSS1                           BANKMASK(T3GATE), 1
#define T3GSS2                           BANKMASK(T3GATE), 2
#define T3GSS3                           BANKMASK(T3GATE), 3
#define T3GSS4                           BANKMASK(T3GATE), 4
#define T3GTM                            BANKMASK(T3GCON), 5
#define T3GVAL                           BANKMASK(T3GCON), 2
#define T3RD16                           BANKMASK(T3CON), 1
#define T4CKPS0                          BANKMASK(T4CON), 4
#define T4CKPS1                          BANKMASK(T4CON), 5
#define T4CKPS2                          BANKMASK(T4CON), 6
#define T4CPOL                           BANKMASK(T4HLT), 6
#define T4CS0                            BANKMASK(T4CLKCON), 0
#define T4CS1                            BANKMASK(T4CLKCON), 1
#define T4CS2                            BANKMASK(T4CLKCON), 2
#define T4CS3                            BANKMASK(T4CLKCON), 3
#define T4CSYNC                          BANKMASK(T4HLT), 5
#define T4MODE0                          BANKMASK(T4HLT), 0
#define T4MODE1                          BANKMASK(T4HLT), 1
#define T4MODE2                          BANKMASK(T4HLT), 2
#define T4MODE3                          BANKMASK(T4HLT), 3
#define T4MODE4                          BANKMASK(T4HLT), 4
#define T4ON                             BANKMASK(T4CON), 7
#define T4OUTPS0                         BANKMASK(T4CON), 0
#define T4OUTPS1                         BANKMASK(T4CON), 1
#define T4OUTPS2                         BANKMASK(T4CON), 2
#define T4OUTPS3                         BANKMASK(T4CON), 3
#define T4PSYNC                          BANKMASK(T4HLT), 7
#define T4RSEL0                          BANKMASK(T4RST), 0
#define T4RSEL1                          BANKMASK(T4RST), 1
#define T4RSEL2                          BANKMASK(T4RST), 2
#define T4RSEL3                          BANKMASK(T4RST), 3
#define T4RSEL4                          BANKMASK(T4RST), 4
#define T6CKPS0                          BANKMASK(T6CON), 4
#define T6CKPS1                          BANKMASK(T6CON), 5
#define T6CKPS2                          BANKMASK(T6CON), 6
#define T6CPOL                           BANKMASK(T6HLT), 6
#define T6CS0                            BANKMASK(T6CLKCON), 0
#define T6CS1                            BANKMASK(T6CLKCON), 1
#define T6CS2                            BANKMASK(T6CLKCON), 2
#define T6CS3                            BANKMASK(T6CLKCON), 3
#define T6CSYNC                          BANKMASK(T6HLT), 5
#define T6MODE0                          BANKMASK(T6HLT), 0
#define T6MODE1                          BANKMASK(T6HLT), 1
#define T6MODE2                          BANKMASK(T6HLT), 2
#define T6MODE3                          BANKMASK(T6HLT), 3
#define T6MODE4                          BANKMASK(T6HLT), 4
#define T6ON                             BANKMASK(T6CON), 7
#define T6OUTPS0                         BANKMASK(T6CON), 0
#define T6OUTPS1                         BANKMASK(T6CON), 1
#define T6OUTPS2                         BANKMASK(T6CON), 2
#define T6OUTPS3                         BANKMASK(T6CON), 3
#define T6PSYNC                          BANKMASK(T6HLT), 7
#define T6RSEL0                          BANKMASK(T6RST), 0
#define T6RSEL1                          BANKMASK(T6RST), 1
#define T6RSEL2                          BANKMASK(T6RST), 2
#define T6RSEL3                          BANKMASK(T6RST), 3
#define T6RSEL4                          BANKMASK(T6RST), 4
#define TMD0                             BANKMASK(ADCON3), 0
#define TMD1                             BANKMASK(ADCON3), 1
#define TMD2                             BANKMASK(ADCON3), 2
#define TMR0H0                           BANKMASK(TMR0H), 0
#define TMR0H1                           BANKMASK(TMR0H), 1
#define TMR0H2                           BANKMASK(TMR0H), 2
#define TMR0H3                           BANKMASK(TMR0H), 3
#define TMR0H4                           BANKMASK(TMR0H), 4
#define TMR0H5                           BANKMASK(TMR0H), 5
#define TMR0H6                           BANKMASK(TMR0H), 6
#define TMR0H7                           BANKMASK(TMR0H), 7
#define TMR0IE                           BANKMASK(PIE0), 5
#define TMR0IF                           BANKMASK(PIR0), 5
#define TMR0L0                           BANKMASK(TMR0L), 0
#define TMR0L1                           BANKMASK(TMR0L), 1
#define TMR0L2                           BANKMASK(TMR0L), 2
#define TMR0L3                           BANKMASK(TMR0L), 3
#define TMR0L4                           BANKMASK(TMR0L), 4
#define TMR0L5                           BANKMASK(TMR0L), 5
#define TMR0L6                           BANKMASK(TMR0L), 6
#define TMR0L7                           BANKMASK(TMR0L), 7
#define TMR0MD                           BANKMASK(PMD0), 7
#define TMR10                            BANKMASK(TMR1L), 0
#define TMR11                            BANKMASK(TMR1L), 1
#define TMR110                           BANKMASK(TMR1H), 2
#define TMR111                           BANKMASK(TMR1H), 3
#define TMR112                           BANKMASK(TMR1H), 4
#define TMR113                           BANKMASK(TMR1H), 5
#define TMR114                           BANKMASK(TMR1H), 6
#define TMR115                           BANKMASK(TMR1H), 7
#define TMR12                            BANKMASK(TMR1L), 2
#define TMR13                            BANKMASK(TMR1L), 3
#define TMR14                            BANKMASK(TMR1L), 4
#define TMR15                            BANKMASK(TMR1L), 5
#define TMR16                            BANKMASK(TMR1L), 6
#define TMR17                            BANKMASK(TMR1L), 7
#define TMR18                            BANKMASK(TMR1H), 0
#define TMR19                            BANKMASK(TMR1H), 1
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1H0                           BANKMASK(TMR1H), 0
#define TMR1H1                           BANKMASK(TMR1H), 1
#define TMR1H2                           BANKMASK(TMR1H), 2
#define TMR1H3                           BANKMASK(TMR1H), 3
#define TMR1H4                           BANKMASK(TMR1H), 4
#define TMR1H5                           BANKMASK(TMR1H), 5
#define TMR1H6                           BANKMASK(TMR1H), 6
#define TMR1H7                           BANKMASK(TMR1H), 7
#define TMR1IE                           BANKMASK(PIE1), 6
#define TMR1IF                           BANKMASK(PIR1), 6
#define TMR1L0                           BANKMASK(TMR1L), 0
#define TMR1L1                           BANKMASK(TMR1L), 1
#define TMR1L2                           BANKMASK(TMR1L), 2
#define TMR1L3                           BANKMASK(TMR1L), 3
#define TMR1L4                           BANKMASK(TMR1L), 4
#define TMR1L5                           BANKMASK(TMR1L), 5
#define TMR1L6                           BANKMASK(TMR1L), 6
#define TMR1L7                           BANKMASK(TMR1L), 7
#define TMR1MD                           BANKMASK(PMD1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE2), 2
#define TMR2IF                           BANKMASK(PIR2), 2
#define TMR2MD                           BANKMASK(PMD1), 2
#define TMR2ON                           BANKMASK(T2CON), 7
#define TMR30                            BANKMASK(TMR3L), 0
#define TMR31                            BANKMASK(TMR3L), 1
#define TMR310                           BANKMASK(TMR3H), 2
#define TMR311                           BANKMASK(TMR3H), 3
#define TMR312                           BANKMASK(TMR3H), 4
#define TMR313                           BANKMASK(TMR3H), 5
#define TMR314                           BANKMASK(TMR3H), 6
#define TMR315                           BANKMASK(TMR3H), 7
#define TMR32                            BANKMASK(TMR3L), 2
#define TMR33                            BANKMASK(TMR3L), 3
#define TMR34                            BANKMASK(TMR3L), 4
#define TMR35                            BANKMASK(TMR3L), 5
#define TMR36                            BANKMASK(TMR3L), 6
#define TMR37                            BANKMASK(TMR3L), 7
#define TMR38                            BANKMASK(TMR3H), 0
#define TMR39                            BANKMASK(TMR3H), 1
#define TMR3GIE                          BANKMASK(PIE2), 1
#define TMR3GIF                          BANKMASK(PIR2), 1
#define TMR3H0                           BANKMASK(TMR3H), 0
#define TMR3H1                           BANKMASK(TMR3H), 1
#define TMR3H2                           BANKMASK(TMR3H), 2
#define TMR3H3                           BANKMASK(TMR3H), 3
#define TMR3H4                           BANKMASK(TMR3H), 4
#define TMR3H5                           BANKMASK(TMR3H), 5
#define TMR3H6                           BANKMASK(TMR3H), 6
#define TMR3H7                           BANKMASK(TMR3H), 7
#define TMR3IE                           BANKMASK(PIE2), 0
#define TMR3IF                           BANKMASK(PIR2), 0
#define TMR3L0                           BANKMASK(TMR3L), 0
#define TMR3L1                           BANKMASK(TMR3L), 1
#define TMR3L2                           BANKMASK(TMR3L), 2
#define TMR3L3                           BANKMASK(TMR3L), 3
#define TMR3L4                           BANKMASK(TMR3L), 4
#define TMR3L5                           BANKMASK(TMR3L), 5
#define TMR3L6                           BANKMASK(TMR3L), 6
#define TMR3L7                           BANKMASK(TMR3L), 7
#define TMR3MD                           BANKMASK(PMD1), 1
#define TMR3ON                           BANKMASK(T3CON), 0
#define TMR4IE                           BANKMASK(PIE2), 3
#define TMR4IF                           BANKMASK(PIR2), 3
#define TMR4MD                           BANKMASK(PMD1), 3
#define TMR4ON                           BANKMASK(T4CON), 7
#define TMR6IE                           BANKMASK(PIE2), 4
#define TMR6IF                           BANKMASK(PIR2), 4
#define TMR6MD                           BANKMASK(PMD1), 4
#define TMR6ON                           BANKMASK(T6CON), 7
#define TOSH0                            BANKMASK(TOSH), 0
#define TOSH1                            BANKMASK(TOSH), 1
#define TOSH2                            BANKMASK(TOSH), 2
#define TOSH3                            BANKMASK(TOSH), 3
#define TOSH4                            BANKMASK(TOSH), 4
#define TOSH5                            BANKMASK(TOSH), 5
#define TOSH6                            BANKMASK(TOSH), 6
#define TOSH7                            BANKMASK(TOSH), 7
#define TOSL0                            BANKMASK(TOSL), 0
#define TOSL1                            BANKMASK(TOSL), 1
#define TOSL2                            BANKMASK(TOSL), 2
#define TOSL3                            BANKMASK(TOSL), 3
#define TOSL4                            BANKMASK(TOSL), 4
#define TOSL5                            BANKMASK(TOSL), 5
#define TOSL6                            BANKMASK(TOSL), 6
#define TOSL7                            BANKMASK(TOSL), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISA6                           BANKMASK(TRISA), 6
#define TRISA7                           BANKMASK(TRISA), 7
#define TRISB0                           BANKMASK(TRISB), 0
#define TRISB1                           BANKMASK(TRISB), 1
#define TRISB2                           BANKMASK(TRISB), 2
#define TRISB3                           BANKMASK(TRISB), 3
#define TRISB4                           BANKMASK(TRISB), 4
#define TRISB5                           BANKMASK(TRISB), 5
#define TRISB6                           BANKMASK(TRISB), 6
#define TRISB7                           BANKMASK(TRISB), 7
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRISC6                           BANKMASK(TRISC), 6
#define TRISC7                           BANKMASK(TRISC), 7
#define TRISD0                           BANKMASK(TRISD), 0
#define TRISD1                           BANKMASK(TRISD), 1
#define TRISD2                           BANKMASK(TRISD), 2
#define TRISD3                           BANKMASK(TRISD), 3
#define TRISD4                           BANKMASK(TRISD), 4
#define TRISD5                           BANKMASK(TRISD), 5
#define TRISD6                           BANKMASK(TRISD), 6
#define TRISD7                           BANKMASK(TRISD), 7
#define TRISE0                           BANKMASK(TRISE), 0
#define TRISE1                           BANKMASK(TRISE), 1
#define TRISE2                           BANKMASK(TRISE), 2
#define TRISE3                           BANKMASK(TRISE), 3
#define TSEN                             BANKMASK(FVRCON), 5
#define TSRNG                            BANKMASK(FVRCON), 4
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define TUN5                             BANKMASK(OSCTUNE), 5
#define TX1IE                            BANKMASK(PIE4), 6
#define TX1IF                            BANKMASK(PIR4), 6
#define TX2IE                            BANKMASK(PIE5), 0
#define TX2IF                            BANKMASK(PIR5), 0
#define UA1                              BANKMASK(SSP1STAT), 1
#define UA2                              BANKMASK(SSP2STAT), 1
#define UART1MD                          BANKMASK(PMD3), 1
#define UART2MD                          BANKMASK(PMD3), 2
#define UTH0                             BANKMASK(ADUTHL), 0
#define UTH1                             BANKMASK(ADUTHL), 1
#define UTH10                            BANKMASK(ADUTHH), 2
#define UTH11                            BANKMASK(ADUTHH), 3
#define UTH12                            BANKMASK(ADUTHH), 4
#define UTH13                            BANKMASK(ADUTHH), 5
#define UTH14                            BANKMASK(ADUTHH), 6
#define UTH15                            BANKMASK(ADUTHH), 7
#define UTH2                             BANKMASK(ADUTHL), 2
#define UTH3                             BANKMASK(ADUTHL), 3
#define UTH4                             BANKMASK(ADUTHL), 4
#define UTH5                             BANKMASK(ADUTHL), 5
#define UTH6                             BANKMASK(ADUTHL), 6
#define UTH7                             BANKMASK(ADUTHL), 7
#define UTH8                             BANKMASK(ADUTHH), 0
#define UTH9                             BANKMASK(ADUTHH), 1
#define UTHR                             BANKMASK(ADSTAT), 6
#define VLPDACEN                         BANKMASK(VLPCON), 6
#define VLPDACV0                         BANKMASK(VLPDACV), 0
#define VLPDACV1                         BANKMASK(VLPDACV), 1
#define VLPDACV2                         BANKMASK(VLPDACV), 2
#define VLPDACV3                         BANKMASK(VLPDACV), 3
#define VLPDACV4                         BANKMASK(VLPDACV), 4
#define VLPDACV5                         BANKMASK(VLPDACV), 5
#define VLPDOP                           BANKMASK(VLPCON), 0
#define VLPDSEL                          BANKMASK(VLPCON), 1
#define VLPEN                            BANKMASK(VLPCON), 7
#define VLPRDY                           BANKMASK(VLPCON), 5
#define VREFLPMD                         BANKMASK(PMD5), 1
#define WCOL1                            BANKMASK(SSP1CON1), 7
#define WCOL2                            BANKMASK(SSP2CON1), 7
#define WDTCS0                           BANKMASK(WDTCON1), 4
#define WDTCS1                           BANKMASK(WDTCON1), 5
#define WDTCS2                           BANKMASK(WDTCON1), 6
#define WDTPS0                           BANKMASK(WDTCON0), 1
#define WDTPS1                           BANKMASK(WDTCON0), 2
#define WDTPS2                           BANKMASK(WDTCON0), 3
#define WDTPS3                           BANKMASK(WDTCON0), 4
#define WDTPS4                           BANKMASK(WDTCON0), 5
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1
#define WDTSEN                           BANKMASK(WDTCON0), 0
#define WDTSTATE                         BANKMASK(WDTTMR), 2
#define WDTTMR0                          BANKMASK(WDTTMR), 3
#define WDTTMR1                          BANKMASK(WDTTMR), 4
#define WDTTMR2                          BANKMASK(WDTTMR), 5
#define WDTTMR3                          BANKMASK(WDTTMR), 6
#define WDTTMR4                          BANKMASK(WDTTMR), 7
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2
#define WINDOW0                          BANKMASK(WDTCON1), 0
#define WINDOW1                          BANKMASK(WDTCON1), 1
#define WINDOW2                          BANKMASK(WDTCON1), 2
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WPUA6                            BANKMASK(WPUA), 6
#define WPUA7                            BANKMASK(WPUA), 7
#define WPUB0                            BANKMASK(WPUB), 0
#define WPUB1                            BANKMASK(WPUB), 1
#define WPUB2                            BANKMASK(WPUB), 2
